Tekla.Structures.Drawing.PickerInputPoint
The PickerInputPoint class represents a pick of one point in a view.
Used for values asked by UI.Picker.PickPoint(string Prompt, out Point PickedPoint, out ViewBase PickedView).

Tekla.Structures.Drawing.PickerInputPoint.PickedPoint
The picked point in the view coordinates.

Tekla.Structures.Drawing.PickerInputPoint.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PickerInputPoint.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point)
Creates a new PickerInputPoint instance with one point selected in a view.
pickedView: The view in which the pick occurred.
pickedPoint: The picked point in the view coordinates.